src/cf/InformationRegisters/ItobПараметрыГеографическихЗон.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ItobПараметрыГеографическихЗон</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИспользоватьПриГеокодировании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ГеографическаяЗона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ItobГеографическаяЗона</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ItobТочкиГеографическихЗон.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ItobТочкиГеографическихЗон</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Широта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Долгота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ГеографическаяЗона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ItobВладелецТочекГеографическихЗон</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерТочки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/ItobГеографическиеЗоны.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ItobГеографическиеЗоны</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УдалитьИспользоватьПриГеокодировании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УдалитьТочки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Широта</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>9</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Долгота</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>9</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/ItobГеографическиеЗоныОбновлениеИБ/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Географические зоны (обновление информационной базы)
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Добавляет в список процедуры-обработчики обновления данных ИБ
// для всех поддерживаемых версий библиотеки или конфигурации.
// Вызывается перед началом обновления данных ИБ для построения плана обновления.
//
// Параметры:
//  Обработчики - ТаблицаЗначений - См. процедуру ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления.
//
// Пример:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.Версия              = "1.1.0.0";
//  Обработчик.Процедура           = "ОбновлениеИБ.ПерейтиНаВерсию_1_1_0_0";
//  Обработчик.РежимВыполнения     = "Монопольно";
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.1.8.39";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "ItobГеографическиеЗоныОбновлениеИБ.ПеремещениеРеквизитовГеографическихЗонВРегистрыСведений";	

КонецПроцедуры
 
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПеремещениеРеквизитовГеографическихЗонВРегистрыСведений() Экспорт // "1.1.8.39"
	// Если используется типовой справочник "Географические зоны".
	Если "ItobГеографическиеЗоны" = ItobВызовСервераПовтИсп.ПолучитьИмяОбъекта("ГеографическиеЗоны") Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ItobГеографическиеЗоныУдалитьТочки.Ссылка КАК Ссылка,
		                      |	ItobГеографическиеЗоныУдалитьТочки.НомерСтроки,
		                      |	ItobГеографическиеЗоныУдалитьТочки.Широта,
		                      |	ItobГеографическиеЗоныУдалитьТочки.Долгота,
		                      |	ItobГеографическиеЗоныУдалитьТочки.Ссылка.УдалитьИспользоватьПриГеокодировании КАК ИспользоватьПриГеокодировании
		                      |ИЗ
		                      |	Справочник.ItobГеографическиеЗоны.УдалитьТочки КАК ItobГеографическиеЗоныУдалитьТочки
		                      |ИТОГИ ПО
		                      |	Ссылка");
		ВыборкаГеографическаяЗона = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаГеографическаяЗона.Следующий() Цикл
			Запись = РегистрыСведений.ItobПараметрыГеографическихЗон.СоздатьМенеджерЗаписи();
			Запись.ГеографическаяЗона 			 = ВыборкаГеографическаяЗона.Ссылка;
			Запись.ИспользоватьПриГеокодировании = ВыборкаГеографическаяЗона.ИспользоватьПриГеокодировании;
			Запись.Записать();
			Выборка = ВыборкаГеографическаяЗона.Выбрать();
			Пока Выборка.Следующий() Цикл
				Запись = РегистрыСведений.ItobТочкиГеографическихЗон.СоздатьМенеджерЗаписи();
				Запись.ГеографическаяЗона = Выборка.Ссылка;
			    Запись.НомерТочки = Выборка.НомерСтроки;
				Запись.Широта = Выборка.Широта;
				Запись.Долгота = Выборка.Долгота;
				Запись.Записать();
			КонецЦикла; 
		КонецЦикла;
	КонецЕсли; 
КонецПроцедуры

#КонецОбласти
